In [14]:
import pandas as pd
import numpy as np

In [15]:
df1 = pd.read_csv(r'..\..\data\raw\awi_spam_emails.csv')
df2 = pd.read_csv(r'..\..\data\raw\email_spam.csv')
df3 = pd.read_csv(r'..\..\data\raw\fq_spam.csv')
df4 = pd.read_csv(r'..\..\data\raw\spam_or_not_spam.csv')
df5 = pd.read_csv(r'..\..\data\raw\uciml_spam.csv', encoding='latin')
df6 = pd.read_csv(r'..\..\data\raw\vg_email.csv')

In [16]:
list_of_df = [df1, df2, df3, df4, df5, df6]
for ds in list_of_df:
    display(ds.describe())

       Category                 Message
count      5572                    5572
unique        2                    5157
top         ham  Sorry, I'll call later
freq       4825                      30

       Category                 Message
count      5573                    5573
unique        3                    5158
top         ham  Sorry, I'll call later
freq       4825                      30

       Category                 Message
count      5572                    5572
unique        2                    5157
top         ham  Sorry, I'll call later
freq       4825                      30

             label
count  3000.000000
mean      0.166667
std       0.372740
min       0.000000
25%       0.000000
50%       0.000000
75%       0.000000
max       1.000000

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
count,5572,5572,50,12,6
unique,2,5169,43,10,5
top,ham,"Sorry, I'll call later","bt not his girlfrnd... G o o d n i g h t . . .@""","MK17 92H. 450Ppw 16""","GNT:-)"""
freq,4825,30,3,2,2

        Unnamed: 0    label_num
count  5171.000000  5171.000000
mean   2585.000000     0.289886
std    1492.883452     0.453753
min       0.000000     0.000000
25%    1292.500000     0.000000
50%    2585.000000     0.000000
75%    3877.500000     1.000000
max    5170.000000     1.000000

the datasets 1,2 and 3 appear to be similar

### Standarizing the dataset

In [17]:
for ds in list_of_df:
    ds.columns = ds.columns.str.lower().str.replace(' ', '_')

In [18]:
for ds in list_of_df:
    print(ds.columns)

Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['email', 'label'], dtype='object')
Index(['v1', 'v2', 'unnamed:_2', 'unnamed:_3', 'unnamed:_4'], dtype='object')
Index(['unnamed:_0', 'label', 'text', 'label_num'], dtype='object')

In [19]:
# standardizing all the datasets
df4 = df4[['label','email']].rename(columns={'label':'category','email':'message'})
df5 = df5[['v1','v2']].rename(columns={'v1':'category','v2':'message'})
df6 = df6[['label_num','text']].rename(columns={'label_num':'category','text':'message'})

In [20]:
list_of_df = [df1, df2, df3, df4, df5, df6]

In [21]:
for ds in list_of_df:
    print(ds.columns)

Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')

In [22]:
# appending all the datasets into one
df = pd.concat(list_of_df)
df.shape

(30460, 2)

In [23]:
# dropping all the identical rows of data
df = df.drop_duplicates()
df.shape

(13736, 2)

In [26]:
# checking the classes
df['category'].value_counts()

category
0                 5976
ham               4980
1                 1890
spam               889
{"mode":"full"       1
Name: count, dtype: int64

In [27]:
df = df.loc[~df['category'].astype(str).str.contains(r'{"mode":"full"', regex=True)]
df['category'] = df['category'].replace({'ham': 0, 'spam': 1})

C:\Users\Asif Sayyed\AppData\Local\Temp\ipykernel_16964\1361099758.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['category'] = df['category'].replace({'ham': 0, 'spam': 1})

In [28]:
df['category'].value_counts()

category
0    10956
1     2779
Name: count, dtype: int64